app/Controllers/Apoteker.php

SELECT *
FROM `tb_pasien`
WHERE `id` = '45'
 LIMIT 1
---
    public function resep($id)
    {
        $session = session();
        $user = $this->M_Apoteker->where('id', $_SESSION['id'])->first();
        $user["jabatan"] = "APOTEKER";

        $data['pasien'] = $this->M_Pasien->where(["id" => $id])->first();