app/Controllers/Dokter.php

SELECT *
FROM `tb_dokter`
WHERE `id` = '7'
 LIMIT 1
---
    public function daftar_pasien()
    {
        $session = session();
        date_default_timezone_set('Asia/Jakarta');
        $currentDate = new DateTime();
        $user = $this->M_Dokter->where('id', $_SESSION['id'])->first();

SELECT *
FROM `tb_dokter`
WHERE `id` = '7'
 LIMIT 1
---
    public function search_pasien()
    {
        $session = session();
        $user = $this->M_Dokter->where('id', $_SESSION['id'])->first();

SELECT *
FROM `tb_pasien`
WHERE `id` = '45'
 LIMIT 1
SELECT *
FROM `assesment`
WHERE `idPasien` = '45'
ORDER BY `tanggal` DESC
 LIMIT 1
---
    public function Soap($id)
    {
        $session = session();
        $user = $this->M_Dokter->where('id', $_SESSION['id'])->first();
        $user["jabatan"] = "DOKTER";

        $data['pasien'] = $this->M_Pasien->where(["id" => $id])->first();
        date_default_timezone_set('Asia/Jakarta');
        $currentDate = new DateTime();
        $tanggalLahir = new DateTime($data['pasien']['tanggalLahir']);
        $data['pasien']['umur'] = $tanggalLahir->diff($currentDate)->format('%y Tahun %m Bulan %d Hari');
        $data['pasien']['tanggalLahir'] = date_format($tanggalLahir, "d/m/Y");
        $data['template'] = $this->M_Template->where(["idDokter" => $_SESSION['id']])->findAll();
        $data['assesment'] = $this->M_Assesment->where(["idPasien" => $id])->orderBy('tanggal', 'desc')->first();